def train_answer1():
    """Функция выводится, если игра проиграна"""
    print('На подоконнике лежит фотография человека, которого Вы когда-то любили')
    print('Вы погружаетесь в воспоминания и теряете счет времени. Поезд ушел!')
    print('=' * 20)
    print('Начать заново?')
    print('[1] - начать')
    print('[2] - вернуться в меню игр')
    answer = int(input("Выберите действие: "))
    if answer == 1:
        train()

def train_verion():
    print('[1] – Посмотреть в рюкзаке')
    print('[2] – Посмотреть на подоконнике')

def train_end():
    """Функция выводится, если игра выиграна"""
    print('Второй ключ найден! Бегите, чтобы не опоздать!')
    print('=' * 27)
    print('Начать заново?')
    print('[1] - начать')
    print('[2] - вернуться в меню игр')
    answer = int(input("Выберите действие: "))
    if answer == 1:
        train()

def train():
    print('10 минут, чтобы не опоздать на поезд, но Вы не знаете, где найти ключи от дома. Где их искать?')
    print('[1] – В куртке')
    print('[2] – На кухне')
    answer = int(input('Ваше решение: '))
    if answer == 1:
        print('Карманы куртки пусты. 3 минуты прошло. Где искать дальше?')
        print('[1] – На кухне')
        print('[2] – На подоконнике')
        answer_1 = int(input('Ваше решение:  '))
        if answer_1 == 1:
            print('На кухне есть только один ключ. Прошло еще 3 минуты. Куда отправимся далее?')
            train_verion()
            answer_2 = int(input('Ваше решение:  '))
            if answer_2 == 1:
                train_end()
            if answer_2 == 2:
                train_answer1()
        if answer_1 == 2:
            train_answer1()
    if answer == 2:
        print('На кухне есть только один ключ. Прошло еще 3 минуты. Куда отправимся далее?')
        train_verion()
        answer_3 = int(input('Ваше решение: '))
        if answer_3 == 1:
            train_end()
        if answer_3 == 2:
            train_answer1()
